In [1]:
import pandas as pd
import numpy as np

In [2]:
#syntax of series

In [4]:
series = pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
series1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(series1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
for i in series1:
    print(i)

1
2
3
4
5

In [9]:
#creating series using numpy

In [10]:
series2 = pd.Series(np.random.randn(5),
                   index=['a','b','c','d','e'])
print(series2)

a    0.782109
b   -0.243053
c   -0.548238
d   -0.822780
e    1.194464
dtype: float64

In [11]:
#creating series using dictionary
dictionary = {'a':1,'b':2,'c':3}
d1 = pd.Series(dictionary)
d1

a    1
b    2
c    3
dtype: int64

In [12]:
#dataframe

In [13]:
d1.iloc[[1,2]]

b    2
c    3
dtype: int64

In [14]:
series1 + series2

a    1.782109
b    1.756947
c    2.451762
d    3.177220
e    6.194464
dtype: float64

In [15]:
series + series2

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [16]:
#empty dataframe

In [17]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [18]:
df = pd.DataFrame(columns = ['c1','c2','c3'])
print(df)

Empty DataFrame
Columns: [c1, c2, c3]
Index: []

In [20]:
df = pd.DataFrame(columns = ['c1','c2','c3','c4'],
                 index = range(1,6))
df

    c1   c2   c3   c4
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN

In [21]:
dictionary = {'a':1,'b':2,'c':3}
pd.DataFrame([dictionary])

   a  b  c
0  1  2  3

In [22]:
df.index

RangeIndex(start=1, stop=6, step=1)

In [23]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [25]:
mylist = [
    ['Apple','Red'],
    ['Banana','yellow'],
    ['Orange','orange']
]
mydata = pd.DataFrame(mylist)
mydata

        0       1
0   Apple     Red
1  Banana  yellow
2  Orange  orange

In [27]:
mydata = pd.DataFrame(mylist,columns=['Fruit_name','color'])
mydata

  Fruit_name   color
0      Apple     Red
1     Banana  yellow
2     Orange  orange

In [29]:
df = pd.read_csv("cereals.csv")
df

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843
5    Apple Cinnamon Cheerios       110        2        25  29.509541
6                Apple Jacks       110        2        25  33.174094
7                    Basic 4       130        3        25  37.038562
8                  Bran Chex        90        2        25  49.120253
9                Bran Flakes        90        3        25  53.313813

In [31]:
df.set_index('name')

                           calories  protein  vitamins     rating
name
100% Bran                        70        4        25  68.402973
100% Natural Bran               120        3         0  33.983679
All-Bran                         70        4        25  59.425505
All-Bran with Extra Fiber        50        4        25  93.704912
Almond Delight                  110        2        25  34.384843
Apple Cinnamon Cheerios         110        2        25  29.509541
Apple Jacks                     110        2        25  33.174094
Basic 4                         130        3        25  37.038562
Bran Chex                        90        2        25  49.120253
Bran Flakes                      90        3        25  53.313813

In [32]:
df.head()

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843

In [33]:
df.tail()

                      name  calories  protein  vitamins     rating
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
7                  Basic 4       130        3        25  37.038562
8                Bran Chex        90        2        25  49.120253
9              Bran Flakes        90        3        25  53.313813

In [34]:
df.describe()

         calories    protein   vitamins     rating
count   10.000000  10.000000  10.000000  10.000000
mean    95.000000   2.900000  22.500000  49.205817
std     25.495098   0.875595   7.905694  20.315297
min     50.000000   2.000000   0.000000  29.509541
25%     75.000000   2.000000  25.000000  34.083970
50%    100.000000   3.000000  25.000000  43.079408
75%    110.000000   3.750000  25.000000  57.897582
max    130.000000   4.000000  25.000000  93.704912

In [37]:
df [['calories','rating']]

   calories     rating
0        70  68.402973
1       120  33.983679
2        70  59.425505
3        50  93.704912
4       110  34.384843
5       110  29.509541
6       110  33.174094
7       130  37.038562
8        90  49.120253
9        90  53.313813

In [39]:
df[['calories','rating']]

   calories     rating
0        70  68.402973
1       120  33.983679
2        70  59.425505
3        50  93.704912
4       110  34.384843
5       110  29.509541
6       110  33.174094
7       130  37.038562
8        90  49.120253
9        90  53.313813

In [40]:
df1 = df[0:5]
boolen_list = [True,False,True,True,False]
df1[boolen_list]

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912

In [41]:
df['calories']>70

0    False
1     True
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: calories, dtype: bool

In [42]:
condition = df['calories']>70
df[condition]

                      name  calories  protein  vitamins     rating
1        100% Natural Bran       120        3         0  33.983679
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
7                  Basic 4       130        3        25  37.038562
8                Bran Chex        90        2        25  49.120253
9              Bran Flakes        90        3        25  53.313813

In [43]:
#filtering rows using &(and) and |(or) operators

In [48]:
df[(df['calories']>70)&(df['protein']<3)]

                      name  calories  protein  vitamins     rating
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
8                Bran Chex        90        2        25  49.120253

In [49]:
df[(df['calories']>70)|(df['protein']<3)]

                      name  calories  protein  vitamins     rating
1        100% Natural Bran       120        3         0  33.983679
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
7                  Basic 4       130        3        25  37.038562
8                Bran Chex        90        2        25  49.120253
9              Bran Flakes        90        3        25  53.313813

In [52]:
#filetring data using loc()

In [53]:
df.loc[2,'protein']

np.int64(4)

In [54]:
df.loc[0:4,['protein','name']]

   protein                       name
0        4                  100% Bran
1        3          100% Natural Bran
2        4                   All-Bran
3        4  All-Bran with Extra Fiber
4        2             Almond Delight

In [57]:
df1.loc[4] = ['shreya',110,1,25,27.75]
df1

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4                     shreya       110        1        25  27.750000

In [58]:
#Changes made in df1 will also affect df dataset

In [59]:
df

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4                     shreya       110        1        25  27.750000
5    Apple Cinnamon Cheerios       110        2        25  29.509541
6                Apple Jacks       110        2        25  33.174094
7                    Basic 4       130        3        25  37.038562
8                  Bran Chex        90        2        25  49.120253
9                Bran Flakes        90        3        25  53.313813

In [61]:
df1 = df.iloc[0:5,].copy()

In [62]:
df1.drop(3,axis=0,inplace=True)

In [63]:
df1

                name  calories  protein  vitamins     rating
0          100% Bran        70        4        25  68.402973
1  100% Natural Bran       120        3         0  33.983679
2           All-Bran        70        4        25  59.425505
4             shreya       110        1        25  27.750000

In [64]:
df1.drop("name",axis=1)

   calories  protein  vitamins     rating
0        70        4        25  68.402973
1       120        3         0  33.983679
2        70        4        25  59.425505
4       110        1        25  27.750000

In [65]:
df1['My new column']=[1,2,3,4]
df1

                name  calories  protein  vitamins     rating  My new column
0          100% Bran        70        4        25  68.402973              1
1  100% Natural Bran       120        3         0  33.983679              2
2           All-Bran        70        4        25  59.425505              3
4             shreya       110        1        25  27.750000              4

In [66]:
ascending_df = df.sort_values(by='calories')

In [67]:
ascending_df

                        name  calories  protein  vitamins     rating
3  All-Bran with Extra Fiber        50        4        25  93.704912
0                  100% Bran        70        4        25  68.402973
2                   All-Bran        70        4        25  59.425505
8                  Bran Chex        90        2        25  49.120253
9                Bran Flakes        90        3        25  53.313813
5    Apple Cinnamon Cheerios       110        2        25  29.509541
6                Apple Jacks       110        2        25  33.174094
4                     shreya       110        1        25  27.750000
1          100% Natural Bran       120        3         0  33.983679
7                    Basic 4       130        3        25  37.038562

In [68]:
df.columns

Index(['name', 'calories', 'protein', 'vitamins', 'rating'], dtype='object')

In [70]:
df.columns = ['col1','col2','col3','col4','col4']

In [71]:
df

                        col1  col2  col3  col4       col4
0                  100% Bran    70     4    25  68.402973
1          100% Natural Bran   120     3     0  33.983679
2                   All-Bran    70     4    25  59.425505
3  All-Bran with Extra Fiber    50     4    25  93.704912
4                     shreya   110     1    25  27.750000
5    Apple Cinnamon Cheerios   110     2    25  29.509541
6                Apple Jacks   110     2    25  33.174094
7                    Basic 4   130     3    25  37.038562
8                  Bran Chex    90     2    25  49.120253
9                Bran Flakes    90     3    25  53.313813

In [80]:
df.to_csv('C:/Users/Shreya/Desktop/New folder/myfile.csv',index_label=False)

In [86]:
df1 = df1.reset_index(drop=True)
df1

                name  calories  protein  vitamins     rating  My new column
0          100% Bran        70        4        25  68.402973              1
1  100% Natural Bran       120        3         0  33.983679              2
2           All-Bran        70        4        25  59.425505              3
3             shreya       110        1        25  27.750000              4

In [93]:
data ={'Gender':['female','male','female','male'],
'score':[86,89,67,90]}
new_df=pd.DataFrame(data)
new_df

   Gender  score
0  female     86
1    male     89
2  female     67
3    male     90

In [7]:
import numpy as np
import pandas as pd

In [12]:
from numpy import nan

In [16]:
data1 = {'Name':['person1','person2','person3','person4'],
        'Age':[28,27,nan,36]}

In [18]:
data = pd.DataFrame(data1)
data1

{'Name': ['person1', 'person2', 'person3', 'person4'],
 'Age': [28, 27, nan, 36]}

In [19]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [20]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [21]:
data.dropna()

      Name   Age
0  person1  28.0
1  person2  27.0
3  person4  36.0

In [43]:
data2 =  {'Name':['person1','person2','person3','person4'],
        'Age':[28,27,45,36]}

In [44]:
df = pd.DataFrame(data2)
df

      Name  Age
0  person1   28
1  person2   27
2  person3   45
3  person4   36

In [45]:
df['Age'].dtype

dtype('int64')

In [46]:
#filling missing values with mean/median/mode

In [47]:
data['Age'].fillna(data['Age'].mean())
#data['Age'].fillna(data['Age'].mean(),inplace=True)

0    28.000000
1    27.000000
2    30.333333
3    36.000000
Name: Age, dtype: float64

In [48]:
df = pd.DataFrame(data2)
df

      Name  Age
0  person1   28
1  person2   27
2  person3   45
3  person4   36

In [49]:
df['Age'].mode()[0]

np.int64(27)

In [54]:

data2 = {
    'Name': ['person1', 'person2', 'person3', 'person4'],
    'Age': [28, 27, np.nan, 45]  
}

In [55]:
df = pd.DataFrame(data2)
df

      Name   Age
0  person1  28.0
1  person2  27.0
2  person3   NaN
3  person4  45.0

In [64]:
df['Age'].fillna(df['Age'].mode())

0    28.0
1    27.0
2    45.0
3    45.0
Name: Age, dtype: float64

In [66]:
df['Age'].fillna(df['Age'].median())

0    28.0
1    27.0
2    28.0
3    45.0
Name: Age, dtype: float64